MikroElektronika/core_packages/ARM/gcc_clang/startup/toshiba/tmpm4nnf10fg.S
                adds     r4, #12
                b        .L_loop0
.L_loop0_done:

                ldr      r3, =__zero_table_start__
                ldr      r4, =__zero_table_end__

.L_loop2:
                cmp      r3, r4
                bge      .L_loop2_done
                ldr      r1, [r3]
                ldr      r2, [r3, #4]
                movs     r0, 0

.L_loop2_0:
                subs     r2, #4
                itt      ge
                strge    r0, [r1, r2]
                bge      .L_loop2_0

                adds     r3, #8
                b        .L_loop2
.L_loop2_done:

                bl       main

                .fnend
                .size    Reset_Handler, . - Reset_Handler

/* The default macro is not used for HardFault_Handler
 * because this results in a poor debug illusion.
 */
                .thumb_func
                .type    HardFault_Handler, %function
                .weak    HardFault_Handler
                .fnstart
HardFault_Handler:
                b        .
                .fnend
                .size    HardFault_Handler, . - HardFault_Handler

                .thumb_func
                .type    Default_Handler, %function
                .weak    Default_Handler
                .fnstart
Default_Handler:
                b        .
                .fnend
                .size    Default_Handler, . - Default_Handler

/* Macro to define default exception/interrupt handlers.
 * Default handler are weak symbols with an endless loop.
 * They can be overwritten by real handlers.
 */
                .macro   Set_Default_Handler  Handler_Name
                .weak    \Handler_Name
                .set     \Handler_Name, Default_Handler
                .endm


/* Default exception/interrupt handler */

                Set_Default_Handler  NMI_Handler
                Set_Default_Handler  MemManage_Handler
                Set_Default_Handler  BusFault_Handler
                Set_Default_Handler  UsageFault_Handler
                Set_Default_Handler  SVC_Handler
                Set_Default_Handler  DebugMon_Handler
                Set_Default_Handler  PendSV_Handler
                Set_Default_Handler  SysTick_Handler

                Set_Default_Handler  INT00_Handler
                Set_Default_Handler  INT01_Handler
                Set_Default_Handler  INT02_Handler
                Set_Default_Handler  Interrupt3_Handler
                Set_Default_Handler  INT04_Handler
                Set_Default_Handler  INT05_Handler
                Set_Default_Handler  Interrupt6_Handler
                Set_Default_Handler  Interrupt7_Handler
                Set_Default_Handler  INT08_Handler
                Set_Default_Handler  INT09_Handler
                Set_Default_Handler  INT10_Handler
                Set_Default_Handler  INT11_Handler
                Set_Default_Handler  Interrupt12_Handler
                Set_Default_Handler  Interrupt13_Handler
                Set_Default_Handler  Interrupt14_Handler
                Set_Default_Handler  Interrupt15_Handler
                Set_Default_Handler  INTRTC_Handler
                Set_Default_Handler  Interrupt17_Handler
                Set_Default_Handler  Interrupt18_Handler
                Set_Default_Handler  INTISDA_Handler
                Set_Default_Handler  Interrupt20_Handler
                Set_Default_Handler  Interrupt21_Handler
                Set_Default_Handler  INTRMC0_Handler
                Set_Default_Handler  Interrupt23_Handler
                Set_Default_Handler  INTLTTMR0_Handler
                Set_Default_Handler  INTHDMAATC_Handler
                Set_Default_Handler  INTHDMAAERR_Handler
                Set_Default_Handler  INTHDMABTC_Handler
                Set_Default_Handler  INTHDMABERR_Handler
                Set_Default_Handler  INTMDMAATC_Handler
                Set_Default_Handler  INTT32A00_A_CT_Handler
                Set_Default_Handler  INTT32A00_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A01_A_CT_Handler
                Set_Default_Handler  INTT32A01_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A02_A_CT_Handler
                Set_Default_Handler  INTT32A02_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A03_A_CT_Handler
                Set_Default_Handler  INTT32A03_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A04_A_CT_Handler
                Set_Default_Handler  INTT32A04_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A05_A_CT_Handler
                Set_Default_Handler  INTT32A05_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A06_A_CT_Handler
                Set_Default_Handler  INTT32A06_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A07_A_CT_Handler
                Set_Default_Handler  INTT32A07_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A08_A_CT_Handler
                Set_Default_Handler  INTT32A08_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A09_A_CT_Handler
                Set_Default_Handler  INTT32A09_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A10_A_CT_Handler
                Set_Default_Handler  INTT32A10_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A11_A_CT_Handler
                Set_Default_Handler  INTT32A11_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A12_A_CT_Handler
                Set_Default_Handler  INTT32A12_B_C01_CPC_Handler
                Set_Default_Handler  INTT32A13_A_CT_Handler
                Set_Default_Handler  INTT32A13_B_C01_CPC_Handler
                Set_Default_Handler  INTEMG0_Handler
                Set_Default_Handler  INTOVV0_Handler
                Set_Default_Handler  INTPWM0_Handler
                Set_Default_Handler  INTT0RX_Handler
                Set_Default_Handler  INTT0TX_Handler
                Set_Default_Handler  INTT0ERR_Handler
                Set_Default_Handler  INTT1RX_Handler
                Set_Default_Handler  INTT1TX_Handler
                Set_Default_Handler  INTT1ERR_Handler
                Set_Default_Handler  INTT2RX_Handler
                Set_Default_Handler  INTT2TX_Handler
                Set_Default_Handler  INTT2ERR_Handler
                Set_Default_Handler  INTT3RX_Handler
                Set_Default_Handler  INTT3TX_Handler
                Set_Default_Handler  INTT3ERR_Handler
                Set_Default_Handler  INTT4RX_Handler
                Set_Default_Handler  INTT4TX_Handler
                Set_Default_Handler  INTT4ERR_Handler
                Set_Default_Handler  Interrupt76_Handler
                Set_Default_Handler  Interrupt77_Handler
                Set_Default_Handler  Interrupt78_Handler
                Set_Default_Handler  Interrupt79_Handler
                Set_Default_Handler  Interrupt80_Handler
                Set_Default_Handler  Interrupt81_Handler
                Set_Default_Handler  Interrupt82_Handler
                Set_Default_Handler  Interrupt83_Handler
                Set_Default_Handler  Interrupt84_Handler
                Set_Default_Handler  Interrupt85_Handler
                Set_Default_Handler  Interrupt86_Handler
                Set_Default_Handler  Interrupt87_Handler
                Set_Default_Handler  INTSMI0_Handler
                Set_Default_Handler  INTUART0RX_Handler
                Set_Default_Handler  INTUART0TX_Handler
                Set_Default_Handler  INTUART0ERR_Handler
                Set_Default_Handler  INTUART1RX_Handler
                Set_Default_Handler  INTUART1TX_Handler
                Set_Default_Handler  INTUART1ERR_Handler
                Set_Default_Handler  INTUART2RX_Handler
                Set_Default_Handler  INTUART2TX_Handler
                Set_Default_Handler  INTUART2ERR_Handler
                Set_Default_Handler  Interrupt98_Handler
                Set_Default_Handler  Interrupt99_Handler
                Set_Default_Handler  Interrupt100_Handler
                Set_Default_Handler  Interrupt101_Handler
                Set_Default_Handler  Interrupt102_Handler
                Set_Default_Handler  Interrupt103_Handler
                Set_Default_Handler  Interrupt104_Handler
                Set_Default_Handler  Interrupt105_Handler
                Set_Default_Handler  Interrupt106_Handler
                Set_Default_Handler  INTFUART0_Handler
                Set_Default_Handler  Interrupt108_Handler
                Set_Default_Handler  INTI2C0NST_Handler
                Set_Default_Handler  INTI2C0ATX_Handler
                Set_Default_Handler  INTI2C0BRX_Handler
                Set_Default_Handler  INTI2C0NA_Handler
                Set_Default_Handler  INTI2C1NST_Handler
                Set_Default_Handler  INTI2C1ATX_Handler
                Set_Default_Handler  INTI2C1BRX_Handler
                Set_Default_Handler  INTI2C1NA_Handler
                Set_Default_Handler  INTI2C2NST_Handler
                Set_Default_Handler  INTI2C2ATX_Handler
                Set_Default_Handler  INTI2C2BRX_Handler
                Set_Default_Handler  INTI2C2NA_Handler
                Set_Default_Handler  Interrupt121_Handler
                Set_Default_Handler  Interrupt122_Handler
                Set_Default_Handler  Interrupt123_Handler
                Set_Default_Handler  Interrupt124_Handler
                Set_Default_Handler  Interrupt125_Handler
                Set_Default_Handler  Interrupt126_Handler
                Set_Default_Handler  Interrupt127_Handler
                Set_Default_Handler  Interrupt128_Handler
                Set_Default_Handler  INTADACP0_Handler
                Set_Default_Handler  INTADACP1_Handler
                Set_Default_Handler  INTADATRG_Handler
                Set_Default_Handler  INTADASGL_Handler
                Set_Default_Handler  INTADACNT_Handler
                Set_Default_Handler  INTADAHP_Handler
                Set_Default_Handler  INTFLDRDY_Handler
                Set_Default_Handler  INTFLCRDY_Handler
                Set_Default_Handler  Interrupt137_Handler
                Set_Default_Handler  Interrupt138_Handler
                Set_Default_Handler  INTMDMAABERR_Handler
                Set_Default_Handler  INTMDMAADERR_Handler
                Set_Default_Handler  INTI2S0SI_Handler
                Set_Default_Handler  INTI2S0SIERR_Handler
                Set_Default_Handler  INTI2S0SO_Handler
                Set_Default_Handler  INTI2S0SOERR_Handler
                Set_Default_Handler  INTI2S1SI_Handler
                Set_Default_Handler  INTI2S1SIERR_Handler
                Set_Default_Handler  INTI2S1SO_Handler
                Set_Default_Handler  INTI2S1SOERR_Handler
                Set_Default_Handler  INTFIR0_Handler
                Set_Default_Handler  INTTSSI0RX_Handler
                Set_Default_Handler  INTTSSI0TX_Handler
                Set_Default_Handler  INTTSSI0ERR_Handler
                Set_Default_Handler  Interrupt153_Handler
                Set_Default_Handler  Interrupt154_Handler
                Set_Default_Handler  Interrupt155_Handler
                Set_Default_Handler  INTEMA_Handler
                Set_Default_Handler  INTEMAMP_Handler
                Set_Default_Handler  INTCANARXD_Handler
                Set_Default_Handler  INTCANATXD_Handler
                Set_Default_Handler  INTCANAGLB_Handler
                Set_Default_Handler  INTCANBRXD_Handler
                Set_Default_Handler  INTCANBTXD_Handler
                Set_Default_Handler  INTCANBGLB_Handler
                Set_Default_Handler  INTUSBOTGA_Handler
                Set_Default_Handler  INTUSBOTGAWK_Handler
                Set_Default_Handler  Interrupt166_Handler
                Set_Default_Handler  Interrupt167_Handler
                Set_Default_Handler  INTT32A14_A_Handler
                Set_Default_Handler  INTT32A14_B_Handler
                Set_Default_Handler  INTT32A14_CT_Handler
                Set_Default_Handler  INTT32A15_A_Handler
                Set_Default_Handler  INTT32A15_B_Handler
                Set_Default_Handler  INTT32A15_C_Handler
                Set_Default_Handler  INTMDMAADISR_Handler


                .end